In [11]:
import pandas as pd
import numpy as np

df = pd.DataFrame([
                     ['a', '1', 'apple'],
                     ['b', np.nan, 'banana'],
                     ['c', 2, np.nan],
                     [np.nan, 4, np.nan]
                  ], columns=['A','B', 'C'])
df

     A    B       C
0    a    1   apple
1    b  NaN  banana
2    c    2     NaN
3  NaN    4     NaN

In [16]:
df['C'].isna().sum()                 # 该列为空的个数的和

# 空值填充为该列的中位数

2